Revit 2027 API
DWGExportOptions.MergedViews Property
 Whether to merge all views in one file (via XRefs). Default value is false for mergedViews.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool MergedViews { get; set; }
Public Property MergedViews As Boolean
	Get
	Set
public:
property bool MergedViews {
	bool get ();
	void set (bool value);
}
member MergedViews : bool with get, set
Property Value
Boolean
See Also
Reference
DWGExportOptions Class
Autodesk.Revit.DB Namespace